In [1]:
import os
import numpy as np 
import pandas as pd

import mysql.connector
from mysql.connector import Error

In [3]:
connection = mysql.connector.connect(
        host='127.0.0.1',          # Host Name
        database='sql_tutorial',   # Schemas in MySQL a.k.a Database
        user='root',               # Username
        password='****')     # Password when connect to MySQL

cursor = connection.cursor()

cursor.execute("SELECT * FROM student;") # use sql in execute() function.
cursor.fetchall() # Print all Datapoint.

# ***Aggregate Analytics Function***

    - In Python, we can use pandas .agg() function to performance calculation for the dataframe.

In [4]:
employee_sql_df = pd.read_sql_query("SELECT * FROM employee;",connection)
employee_sql_df

   emp_id name  birth_date sex  salary  branch_id  sup_id
0     206   小黃  1998-10-08   F   50000          1     NaN
1     207   小綠  1995-09-16   F   29000          2   206.0
2     208   小黑  2000-05-08   F   35000          3   206.0
3     209   小白  1997-04-12   F   39000          3   207.0
4     210   小蘭  1928-11-10   F   84000          1   207.0

In [5]:
employee_sql_df.groupby('branch_id')['salary'].agg('mean').reset_index(name='average branch salary')

   branch_id  average branch salary
0          1                67000.0
1          2                29000.0
2          3                37000.0

    - In SQL, we can use the following fumction

In [23]:
pd.read_sql_query(
    # Set the desire columns, From which TABLE and groupby which key.  
    "SELECT `branch_id`,AVG(`salary`) as `average branch salary` FROM `employee` GROUP BY `branch_id`;"
    ,connection)

   branch_id  average branch salary
0          1                67000.0
1          2                29000.0
2          3                37000.0